# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы
# с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.


my_list = [7, 5, 3, 3, 2]  # исходный набор чисел

# запрос данных у пользователя
num = int(input('Введите новый элемент рейтинга: '))

# перебор элементов списка
for i in range(len(my_list)):
    if num > my_list[i]:
        my_list.insert(i, num)  # вставка нового элемента перед первым меньшим элементом
        break  # выход из цикла, если вставка произошла
else:
    my_list.append(num)  # добавление элемента в конец списка, если вставка не произошла

# вывод обновленного списка
print(my_list)