# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

# запрос данных у пользователя
user_string = input('Введите строку из нескольких слов, разделённых пробелами: ')

# формирование списка из слов, разделенных пробелом
words = user_string.split()

# вывод нумерованого списка в соответствии с условием задачи
for ind, word in enumerate(words):
    print(ind + 1, word[:10])